-- 红汤搞笑汤
insert into redfunny (标题,汤面, 汤底) values ('吵架','我和老公吵架了，他让我带上东西滚。后来我被逮捕了。', '我和老公吵架后，哭着说他也是属于我的，然后我把他分尸，装进了袋子里一起带走了。');

-- 清汤搞笑汤
insert into clearfunny (标题,汤面, 汤底) values ('放屁','父亲和儿子聊天,儿子放了个屁父亲哭了', '故事发生在美国，孩子犯法入狱了，父亲来看他，聊天的时候，儿子放了个屁，声音很闷，和以前响亮的屁不一样，父亲知道孩子在里面肯定被人欺负了(捡肥皂)所以哭了。');
insert into clearfunny (标题,汤面, 汤底) values ('100块','小明翻开书书里夹着100块他哭了', '小明是作家，但是写的书一直不火有一次他在图书馆看到自己的作品惊喜之余他夹了100块钱进去作为对下一位翻开他作品的人的奖励过了几个月他又来到图书馆翻开书发现 100块原封不动在里面意识到根本没人翻阅他哭了。');
insert into clearfunny(标题,汤面,汤底) values('破产','她走到一栋房子前她就知道她要破产了','她在跟她的朋友们玩大富翁的游戏，手上的钱所剩无几了，轮到她掷骰子，正好骰点是要走到对手的房子那边，而自己手上的钱远远不够缴纳，因此
她在游戏中宣布破产了');
insert into clearfunny(标题,汤面,汤底) values('情侣','一对情侣在家里看电影，小红肚子饿了去厨房找吃的，小明见他许久没回来，并去厨房查看，发现小红竟然死了。','小红，小明其实是蟑螂，四周很黑主人并没有发现她们，小红去亮堂的厨房找吃的，蟑螂的身影就明显了主人发现了小红，拿起拖鞋给它消灭了。
');
insert into clearfunny(标题,汤面,汤底) values('那个声音','那个声音又出现了...我绝望地抱住头，等着那个时刻的到来','考试时，我的脑海中不断回响着“你爱我我爱你蜜雪冰城甜蜜蜜导致我什么题都做不下去。考试快结束了，我十分绝望地抱住了自己的头。');
insert into clearfunny(标题,汤面,汤底) values('砍','一刀、两刀、三刀...那个相处不久的女人一边砍我，却同
时也在哭泣，是可不得我吗?','我是洋葱，女人从超市买回来后，在切我的时候哭了。');
insert into clearfunny(标题,汤面,汤底) values('一支枪','一个男人走进一家酒吧，并向酒保要了一杯水。酒保拿出
一支枪并瞄准。该名男子说:"谢谢你!"然后走了。请问发生了什么事?','男子打嗝，他希望喝一杯水来改善状。酒保意识到这一点，这选择拿枪吓他，男子一紧张之下，打嗝自然消因而衷心感谢酒保后就离开了。');

insert into clearfunny(标题,汤面,汤底) values('一巴掌','一个人半夜醒来打了自己一巴掌然后闻着一股燃烧的味道
安心睡去了。发生了什么?','这个人被蚊子叮醒，打了一下没打着，然后点起了蚊香。');

-- 红汤亲清汤
insert into redlove(标题,汤面,汤底) values('舅舅','我特别恨我的舅舅，于是趁着正月去剪了头。我的舅舅果然
死掉了。','我被舅舅侵犯了，可是我不敢说，只能偷偷写在日记里。我听说正月剪头死男舅，虽然我知道这是迷信可我还是去了。妈妈诧异我为何如此恨我的舅雾，趁我出门时翻看了我的日记知道了男舅的行为，于是妈妈杀了他。');
insert into redlove(标题,汤面,汤底) values('小星星','一闪一闪亮晶晶满天都是小星星。挂在天上放光明好像许
多小眼睛父亲唱着儿子最喜欢的歌谣看着星星满意的入睡了。','儿子有严重的夜盲症，夜晚不敢出门，父亲经常唱《小星星》这首歌鼓励儿子，满天的繁星都是你的眼睛，不要害怕。可儿子还是由于看不清在一次夜晚出门时发生交通事故身亡了。从此父亲性情大变，只要看到与儿子年龄相仿的正常视力的孩子就心生嫉妒于是父亲杀了他们取出他们的眼球，挂在儿子卧室里。父亲看着挂满眼球的卧室，就像星星挂满天空一样，他唱着儿子最喜欢的《小星星》自言自语的说，儿子，爸爸给你找来了这么多双眼睛，你再也不用害怕黑夜了。');
insert into redlove(标题,汤面,汤底) values('骗子','她是一个过气网红最近靠着女儿又小火了一把。可我知道她
是骗子于是我把她的照片发到网上果然，网友们开始骂她，抵制她不久后，我们三个人都死了。','她的女儿得了重病，急需手术。她每天兼职几份工作仍然付不起高昂的手术费。于是她开始在网上筹款。网友们同情她们母女纷纷给她捐款。可是我前几天明明在街上看到她一身名牌，因为她曾经是小有名气的网红所以当时我偷拍了她的照片。我觉得她在欺骗大家。于是把偷拍的照片发到网上。虽然她澄清当时是她在兼职给品牌做模特拍街拍，可是没有人相信她。网友们开始抵制她，也没有工作再找她。由于没有及时缴纳手术费用，她的女儿错过了手术最佳时机而死亡。她觉得一切都是我的错，于是找到我的住址鲨了我。而失去女儿的她生无可恋选择了自鲨。');
insert into redlove(标题,汤面,汤底) values('爷爷','再次看到爷爷，他哭泣着扑进爷爷的怀里嘴角露出了诡异的
笑容。','他的父母生下他就外出打工，他和爷爷相依为命。眼看到了入学的年纪父母为了更好的教育把他接到了身边。可是他不想和并不熟悉的父母住在一块，他想念爷爷，于是他毒杀了父母。而爷爷作为唯一亲属得到了抚养权，他如愿回到了爷爷的身边。');

-- 清汤亲清汤
insert into clearlove(标题,汤面,汤底) values('妈妈','除夕夜，女孩的父亲领着一个陌生的女人对女孩说“这是你
的母亲。女孩抱了抱女人，开心的喊到“妈妈!','女孩的母亲因病去世。死前告诉女孩，妈妈要去一个很远的地方，可能要好久才回来。回来以后妈妈会变了样子，可是妈妈永远爱你。母亲死后父亲将母亲器言捐赠。机缘巧合之下父亲与心脏受捐者走到一起。当女孩抱着受捐者的时候，她知道这是母亲的心脏，她要好好守护着这颗心脏就像守护母亲一样。因为母亲永远爱她，她也爱着母亲');
insert into clearlove(标题,汤面,汤底) values('体重','10月1日:妈妈64kg10月3日:妈妈56kg10月5日:妈妈50kg10
月7日:妈妈60kg10月9日:妈妈1.5kg。','10月1日:产前10月3日:生下双胞胎,但发生难产妈妈变虚弱,体重一直在锐减(10月5日)10月7日情况恶化,各种监测抢救仪器上阵,变重10月9日抢救无效去世，火化。');

-- 变态汤
insert into redmeta(标题,汤面,汤底) values('饺子','妈妈在不停包饺子我们己经吃吐了。妈妈求求你了，真的吃
不下了。我们好好听话可以吗?','妈妈”是孤儿院的护工，她的亲生孩子因为不听她的话意外死掉了。从那以后她让我们叫她妈妈，把我们当成她的孩子。只要不听话就会挨打。经常有伤势过重s掉的孩子。“妈妈”为了不被他人发现，所以把这些s掉的孩子做成肉馅包在饺子里，然后强制我们吃掉这些饺子，我们特别害怕，却不敢忤逆她。');
insert into redmeta(标题,汤面,汤底) values('水果','我和弟弟吃水果，弟弟却消失了','我和弟弟一起吃水果，最后剩下一个梨，弟弟说不想和我分梨(分离)于是我吃了弟弟，然后再把梨吃掉这样就不用分梨了，而且永远都不会分离了。');
insert into redmeta(标题,汤面,汤底) values('洋娃娃','一个洋娃娃一具男尸在一旁的笔记本上有一句话!','女儿得了不治之症快死了爸爸为了让女儿永远留在身边，所以杀死她把她的皮剥下来做成了娃娃，<马妈接受不了，于是杀了爸爸留下一个第记本上面写了:你和你女儿好好在一起吧!');

-- 红汤奇幻汤
insert into redfantasy(标题,汤面,汤底) values('阴阳','孩子哭着，父母哄着；车，停了，回到原处；又笑又哭','孩子拥有着一双阴阳眼，可以看见一些不干净的东西。从路过某个地方起，孩子便一直哭着，父母手忙脚乱的哄着，却一直没有效果，只好请司机停下了车，孩子带着父母到了安全的地方。最后当三人回到原处，结果发现车上的人都死了，原来孩子看见的是厉鬼，杀了全车人，而父母因为孩子的阴阳眼，躲过了一劫，笑着自己活了下来，哭着车上的人都死了。');
insert into redfantasy(标题,汤面,汤底) values('登山旅行','一行驴友登山旅行，半夜听到某处山崖传来呼救声，前
往后发现崖下有一束电筒灯光，询问后听闻下面传来自己是登山者失足坠落的消息，驴友连忙组织人手救援，下去的救援驴友却失去音讯，拉上去发现只有断裂的绳子，驴友们大惊失色，讨论时却突发事件，仓皇逃跑。','崖下出现了两束手电筒的光，和驴友及登山者的呼救声，鬼需要他们陪他做伴，引诱他们走向死亡。');

-- 清汤奇幻汤
insert into clearfantasy(标题,汤面,汤底) values('生','爷爷生了奶奶，妈妈生了爸爸，哥哥生了我','奶奶从小生长在重男轻女的家庭,日子过得不如一条狗，是爷爷将她从泥潭拯救出来,给了她家,给了她新生。后来爷爷奶奶生了爸爸,爸爸又与妈妈相爱结婚妈妈害怕生孩子太痛,但又怕老了留下遗憾于是就和爸爸一起冷冻了卵子和精子，然而天不遂人愿,爸爸在一次意外中去世,妈妈痛失所爱。在纠结一段时间后,妈妈还是顺从内心选择取出了卵子和精子,成为一名单身母亲。妈妈怀的是双胞胎,灵魂不愿离开家人的爸爸直接投胎在了妈妈的肚子里,成为了我的哥哥。');
insert into clearfantasy(标题,汤面,汤底) values('我亲爱的主人','有一名很喜欢泰迪熊的女孩，平日很呵护自己的泰
迪熊，房间里也摆满了熊熊，某日女孩醒来后发现熊熊都围着自己，月光从窗外洒入，熊熊的玻璃眼珠反射出清冷的光，发生了什么？ ','熊熊因为女孩悉心的照顾和对它们的爱而拥有了灵魂，本以为可以这样陪伴女孩到结束，可这天家里却有了不速之客，而且…就在女孩床下！于是它们将他包围，誓死捍卫自己的主人！');

select *from redfunny;
select *from clearfunny;